print("โปรแกรมทำนายรูปร่างโมเลกุลของสารประกอบโคเวเลนต์ที่มีธาตุองค์ประกอบ 2 ชนิด")
element1 = str(input("ธาตุองค์ตัวประกอบในโมเลกุลตัวที่ 1"))
atom1 = int(input("จำนวนของธาตุตัวที่ 1"))
element2 = str(input("ธาตุองค์ตัวประกอบในโมเลกุลตัวที่ 2"))
atom2 = int(input("จำนวนของธาตุตัวที่ 2"))
moleculemass = {
'H': 7,
'Be' : 2,
'B' : 3,
'C' : 4,
'Si' : 4,
'Ge' : 4,
'Sn' : 4,
'Pb' : 4,
'N' : 5,
'P' : 5,
'As' : 5,
'Sb' : 5,
'Bi' : 5,
'O' : 6,
'S' : 6,
'Se' : 6,
'Te' : 6,
'Po' : 6,
'F': 7,
'Cl' : 7,
'Br' : 7,
'I' : 7,
'At' : 7,
'He' : 8,
'Ne' : 8,
'Ar' : 8,
'Kr' : 8,
'Xe' : 8,
'Rn' : 8,
}

A = ((moleculemass[element1] * atom1) + (moleculemass[element2] * atom2))//8
E = (((moleculemass[element1] * atom1) + (moleculemass[element2] * atom2))%8)/2

if (A , E)==(2 , 0):
   print("รูปร่างเส้นตรง สูตร AB2")
elif (A , E)==(3 , 0):
   print("รูปร่างสามเหลี่ยมแบบราบ สูตร AB3")
elif (A , E)==(4 , 0):
   print("รูปร่างทรงสี่หน้า สูตร AB4")
elif (A , E)==(5 , 0):
   print("รูปร่างพีระมิดคู่ฐานสามเหลี่ยม สูตร AB5")
elif (A , E)==(6 , 0):
   print("รูปร่างทรงแปดหน้า สูตร AB6")
elif (A , E)==(2 , 1):
   print("รูปร่างมุมงอ สูตร AB2E")
elif (A , E)==(3 , 1):
   print("รูปร่างพีระมิดฐานสามเหลี่ยม สูตร AB3E")
elif (A , E)==(4 , 1):
   print("รูปร่างทรงสี่หน้าบิดเบี้ยว สูตร AB4E")
elif (A , E)==(5 , 1):
   print("รูปร่างพีระมิดฐานสี่เหลี่ยม สูตร AB5E")
elif (A , E)==(2 , 2):
   print("รูปร่างมุมงอ สูตร AB2E2")
elif (A , E)==(3 , 2):
   print("รูปร่างรูปตัวที สูตร AB3E2")
elif (A , E)==(4 , 2):
   print("รูปร่างสี่เหลี่ยมแบนราบ สูตร AB4E2")
elif (A , E)==(2 , 3):
   print("รูปร่างเส้นตรง สูตร AB2E3")
else:
    print("ข้อมูลมีความผิดพลาด โปรดตรวจสอบความถูกต้อง")